hacperme/rt-thread/bsp/stm32/encortec/application/rt_api/rt_api_typedef.h
typedef HAL_StatusTypeDef (*HAL_HASH_DeInit_api_ptr_t)(HASH_HandleTypeDef *hhash);
typedef HAL_StatusTypeDef (*HAL_HMACEx_SHA256_Start_api_ptr_t)(HASH_HandleTypeDef *hhash, uint8_t *pInBuffer, uint32_t Size, uint8_t *pOutBuffer, uint32_t Timeout);
typedef rt_err_t (*rt_sched_lock_api_ptr_t)(rt_sched_lock_level_t *plvl);
typedef rt_err_t (*rt_sched_unlock_api_ptr_t)(rt_sched_lock_level_t level);
typedef rt_err_t (*rt_sched_unlock_n_resched_api_ptr_t)(rt_sched_lock_level_t level);
typedef const struct fal_flash_dev *(*fal_flash_device_find_api_ptr_t)(const char *name);
typedef const struct fal_partition *(*fal_partition_find_api_ptr_t)(const char *name);
typedef const struct fal_partition *(*fal_get_partition_table_api_ptr_t)(size_t *len);
typedef void (*fal_set_partition_table_temp_api_ptr_t)(struct fal_partition *table, size_t len);
typedef int (*fal_partition_read_api_ptr_t)(const struct fal_partition *part, uint32_t addr, uint8_t *buf, size_t size);
typedef int (*fal_partition_write_api_ptr_t)(const struct fal_partition *part, uint32_t addr, const uint8_t *buf, size_t size);
typedef int (*fal_partition_erase_api_ptr_t)(const struct fal_partition *part, uint32_t addr, size_t size);
typedef int (*fal_partition_erase_all_api_ptr_t)(const struct fal_partition *part);
typedef void (*fal_show_part_table_api_ptr_t)(void);
typedef void (*rt_hw_cpu_reset_api_ptr_t)(void);
typedef mbr_t (*mbr_init_api_ptr_t)(void);
typedef rt_err_t (*mbr_save_api_ptr_t)(void);
typedef void (*HAL_NVIC_SetPriority_api_ptr_t)(IRQn_Type IRQn, uint32_t PreemptPriority, uint32_t SubPriority);
typedef void (*HAL_NVIC_EnableIRQ_api_ptr_t)(IRQn_Type IRQn);
typedef HAL_StatusTypeDef (*HAL_ADC_Init_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADC_DeInit_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_MspInit_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_MspDeInit_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADC_Start_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADC_Stop_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADC_PollForConversion_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t Timeout);
typedef HAL_StatusTypeDef (*HAL_ADC_PollForEvent_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t EventType, uint32_t Timeout);
typedef HAL_StatusTypeDef (*HAL_ADC_Start_IT_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADC_Stop_IT_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADC_Start_DMA_api_ptr_t)(ADC_HandleTypeDef *hadc, const uint32_t *pData, uint32_t Length);
typedef HAL_StatusTypeDef (*HAL_ADC_Stop_DMA_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef uint32_t (*HAL_ADC_GetValue_api_ptr_t)(const ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_IRQHandler_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_ConvCpltCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_ConvHalfCpltCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_LevelOutOfWindowCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_ErrorCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_CalibrationCpltCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_VoltageRegulatorCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADC_ADCReadyCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADC_ConfigChannel_api_ptr_t)(ADC_HandleTypeDef *hadc, ADC_ChannelConfTypeDef *pConfig);
typedef HAL_StatusTypeDef (*HAL_ADC_AnalogWDGConfig_api_ptr_t)(ADC_HandleTypeDef *hadc, ADC_AnalogWDGConfTypeDef *pAnalogWDGConfig);
typedef uint32_t (*HAL_ADC_GetState_api_ptr_t)(const ADC_HandleTypeDef *hadc);
typedef uint32_t (*HAL_ADC_GetError_api_ptr_t)(const ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*ADC_ConversionStop_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t ConversionGroup);
typedef HAL_StatusTypeDef (*ADC_Enable_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*ADC_Disable_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*ADC_DMAConvCplt_api_ptr_t)(DMA_HandleTypeDef *hdma);
typedef void (*ADC_DMAHalfConvCplt_api_ptr_t)(DMA_HandleTypeDef *hdma);
typedef void (*ADC_DMAError_api_ptr_t)(DMA_HandleTypeDef *hdma);
typedef HAL_StatusTypeDef (*HAL_ADCEx_Calibration_Start_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t CalibrationMode, uint32_t SingleDiff);
typedef uint32_t (*HAL_ADCEx_Calibration_GetValue_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t SingleDiff);
typedef HAL_StatusTypeDef (*HAL_ADCEx_LinearCalibration_GetValue_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t *pLinearCalib_Buffer);
typedef HAL_StatusTypeDef (*HAL_ADCEx_Calibration_SetValue_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t SingleDiff, uint32_t CalibrationFactor);
typedef HAL_StatusTypeDef (*HAL_ADCEx_LinearCalibration_SetValue_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t *pLinearCalib_Buffer);
typedef HAL_StatusTypeDef (*HAL_ADCEx_InjectedStart_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_InjectedStop_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_InjectedPollForConversion_api_ptr_t)(ADC_HandleTypeDef *hadc, uint32_t Timeout);
typedef HAL_StatusTypeDef (*HAL_ADCEx_InjectedStart_IT_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_InjectedStop_IT_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef uint32_t (*HAL_ADCEx_InjectedGetValue_api_ptr_t)(const ADC_HandleTypeDef *hadc, uint32_t InjectedRank);
typedef void (*HAL_ADCEx_InjectedConvCpltCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADCEx_InjectedQueueOverflowCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADCEx_LevelOutOfWindow2Callback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADCEx_LevelOutOfWindow3Callback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef void (*HAL_ADCEx_EndOfSamplingCallback_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_RegularStop_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_RegularStop_IT_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_RegularStop_DMA_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_InjectedConfigChannel_api_ptr_t)(ADC_HandleTypeDef *hadc, ADC_InjectionConfTypeDef *pConfigInjected);
typedef HAL_StatusTypeDef (*HAL_ADCEx_DisableVoltageRegulator_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_ADCEx_EnterADCDeepPowerDownMode_api_ptr_t)(ADC_HandleTypeDef *hadc);
typedef HAL_StatusTypeDef (*HAL_DMA_Init_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMA_DeInit_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMA_Start_api_ptr_t)(DMA_HandleTypeDef *const hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t SrcDataSize);
typedef HAL_StatusTypeDef (*HAL_DMA_Start_IT_api_ptr_t)(DMA_HandleTypeDef *const hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t SrcDataSize);
typedef HAL_StatusTypeDef (*HAL_DMA_Abort_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMA_Abort_IT_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMA_PollForTransfer_api_ptr_t)(DMA_HandleTypeDef *const hdma, HAL_DMA_LevelCompleteTypeDef CompleteLevel, uint32_t Timeout);
typedef void (*HAL_DMA_IRQHandler_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMA_RegisterCallback_api_ptr_t)(DMA_HandleTypeDef *const hdma, HAL_DMA_CallbackIDTypeDef CallbackID, void (*pCallback)(DMA_HandleTypeDef *const _hdma));
typedef HAL_StatusTypeDef (*HAL_DMA_UnRegisterCallback_api_ptr_t)(DMA_HandleTypeDef *const hdma, HAL_DMA_CallbackIDTypeDef CallbackID);
typedef HAL_DMA_StateTypeDef (*HAL_DMA_GetState_api_ptr_t)(DMA_HandleTypeDef const *const hdma);
typedef uint32_t (*HAL_DMA_GetError_api_ptr_t)(DMA_HandleTypeDef const *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMA_ConfigChannelAttributes_api_ptr_t)(DMA_HandleTypeDef *const hdma, uint32_t ChannelAttributes);
typedef HAL_StatusTypeDef (*HAL_DMA_GetConfigChannelAttributes_api_ptr_t)(DMA_HandleTypeDef const *const hdma, uint32_t *const pChannelAttributes);
typedef HAL_StatusTypeDef (*HAL_DMA_GetLockChannelAttributes_api_ptr_t)(DMA_HandleTypeDef const *const hdma, uint32_t *const pLockState);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_Init_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_DeInit_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_Start_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_Start_IT_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_BuildNode_api_ptr_t)(DMA_NodeConfTypeDef const *const pNodeConfig, DMA_NodeTypeDef *const pNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_GetNodeConfig_api_ptr_t)(DMA_NodeConfTypeDef *const pNodeConfig, DMA_NodeTypeDef const *const pNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_InsertNode_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pPrevNode, DMA_NodeTypeDef *const pNewNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_InsertNode_Head_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pNewNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_InsertNode_Tail_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pNewNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_RemoveNode_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_RemoveNode_Head_api_ptr_t)(DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_RemoveNode_Tail_api_ptr_t)(DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_ReplaceNode_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pOldNode, DMA_NodeTypeDef *const pNewNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_ReplaceNode_Head_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pNewNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_ReplaceNode_Tail_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pNewNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_ResetQ_api_ptr_t)(DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_InsertQ_api_ptr_t)(DMA_QListTypeDef *const pSrcQList, DMA_NodeTypeDef const *const pPrevNode, DMA_QListTypeDef *const pDestQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_InsertQ_Head_api_ptr_t)(DMA_QListTypeDef *const pSrcQList, DMA_QListTypeDef *const pDestQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_InsertQ_Tail_api_ptr_t)(DMA_QListTypeDef *const pSrcQList, DMA_QListTypeDef *const pDestQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_SetCircularModeConfig_api_ptr_t)(DMA_QListTypeDef *const pQList, DMA_NodeTypeDef *const pFirstCircularNode);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_SetCircularMode_api_ptr_t)(DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_ClearCircularMode_api_ptr_t)(DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_ConvertQToDynamic_api_ptr_t)(DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_ConvertQToStatic_api_ptr_t)(DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_LinkQ_api_ptr_t)(DMA_HandleTypeDef *const hdma, DMA_QListTypeDef *const pQList);
typedef HAL_StatusTypeDef (*HAL_DMAEx_List_UnLinkQ_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMAEx_ConfigDataHandling_api_ptr_t)(DMA_HandleTypeDef *const hdma, DMA_DataHandlingConfTypeDef const *const pConfigDataHandling);
typedef HAL_StatusTypeDef (*HAL_DMAEx_ConfigTrigger_api_ptr_t)(DMA_HandleTypeDef *const hdma, DMA_TriggerConfTypeDef const *const pConfigTrigger);
typedef HAL_StatusTypeDef (*HAL_DMAEx_ConfigRepeatBlock_api_ptr_t)(DMA_HandleTypeDef *const hdma, DMA_RepeatBlockConfTypeDef const *const pConfigRepeatBlock);
typedef HAL_StatusTypeDef (*HAL_DMAEx_Suspend_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMAEx_Suspend_IT_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef HAL_StatusTypeDef (*HAL_DMAEx_Resume_api_ptr_t)(DMA_HandleTypeDef *const hdma);
typedef uint32_t (*HAL_DMAEx_GetFifoLevel_api_ptr_t)(DMA_HandleTypeDef const *const hdma);
typedef void (*get_adc_handle_api_ptr_t)(ADC_HandleTypeDef **hadc);
typedef void (*get_dma_node_api_ptr_t)(DMA_NodeTypeDef **dma_node);
typedef void (*get_dma_qlist_api_ptr_t)(DMA_QListTypeDef **dma_qlist);
typedef void (*get_dma_handle_api_ptr_t)(DMA_HandleTypeDef **dma_handle);
#endif
